jmeter/chat_bench_test.jmx
<?xml version="1.0" encoding="UTF-8"?>
<jmeterTestPlan version="1.2" properties="5.0">
  <hashTree>
    <TestPlan guiclass="TestPlanGui" testclass="TestPlan" testname="채팅 DB vs Redis 성능 비교" enabled="true">
      <stringProp name="TestPlan.comments">TARGET_RPS와 THROUGHPUT_PER_MIN을 같이 바꿔가며 실행
100RPS=6000 / 200RPS=12000 / 300RPS=18000 / 500RPS=30000 / 800RPS=48000 / 1000RPS=60000</stringProp>
      <boolProp name="TestPlan.serialize_threadgroups">false</boolProp>
      <elementProp name="TestPlan.user_defined_variables" elementType="Arguments" guiclass="ArgumentsPanel">
        <collectionProp name="Arguments.arguments">
          <elementProp name="HOST" elementType="Argument">
            <stringProp name="Argument.name">HOST</stringProp>
            <stringProp name="Argument.value">juyoungshop.duckdns.org</stringProp>
          </elementProp>
          <elementProp name="PROTOCOL" elementType="Argument">
            <stringProp name="Argument.name">PROTOCOL</stringProp>
            <stringProp name="Argument.value">https</stringProp>
          </elementProp>
          <elementProp name="PORT" elementType="Argument">
            <stringProp name="Argument.name">PORT</stringProp>
            <stringProp name="Argument.value">443</stringProp>
          </elementProp>
          <!-- ★ 두 값을 같이 바꿔서 실행 ★
               100RPS  → TARGET_RPS=100,  THROUGHPUT_PER_MIN=6000
               200RPS  → TARGET_RPS=200,  THROUGHPUT_PER_MIN=12000
               300RPS  → TARGET_RPS=300,  THROUGHPUT_PER_MIN=18000
               500RPS  → TARGET_RPS=500,  THROUGHPUT_PER_MIN=30000
               800RPS  → TARGET_RPS=800,  THROUGHPUT_PER_MIN=48000
               1000RPS → TARGET_RPS=1000, THROUGHPUT_PER_MIN=60000  -->
          <elementProp name="TARGET_RPS" elementType="Argument">
            <stringProp name="Argument.name">TARGET_RPS</stringProp>
            <stringProp name="Argument.value">100</stringProp>
          </elementProp>
          <elementProp name="THROUGHPUT_PER_MIN" elementType="Argument">
            <stringProp name="Argument.name">THROUGHPUT_PER_MIN</stringProp>
            <stringProp name="Argument.value">6000</stringProp>
          </elementProp>
          <elementProp name="DURATION" elementType="Argument">
            <stringProp name="Argument.name">DURATION</stringProp>
            <stringProp name="Argument.value">60</stringProp>
          </elementProp>
          <elementProp name="ROOM_ID" elementType="Argument">
            <stringProp name="Argument.name">ROOM_ID</stringProp>
            <stringProp name="Argument.value">4</stringProp>
          </elementProp>
          <elementProp name="SENDER_NO" elementType="Argument">
            <stringProp name="Argument.name">SENDER_NO</stringProp>
            <stringProp name="Argument.value">15</stringProp>
          </elementProp>
          <elementProp name="RECEIVER_NO" elementType="Argument">
            <stringProp name="Argument.name">RECEIVER_NO</stringProp>
            <stringProp name="Argument.value">16</stringProp>
          </elementProp>
        </collectionProp>
      </elementProp>
    </TestPlan>
    <hashTree>

      <!-- ===== DB 직접 방식 Thread Group ===== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="DB 직접 방식" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="DB RPS 제어" enabled="true">
          <intProp name="calcMode">1</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>6000.0</value>
          </doubleProp>
          <stringProp name="throughput">${THROUGHPUT_PER_MIN}</stringProp>
        </ConstantThroughputTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="DB 메시지 전송" enabled="true">
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/test/bench/chat/db?roomId=${ROOM_ID}&amp;senderNo=${SENDER_NO}&amp;receiverNo=${RECEIVER_NO}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="DB 결과 저장" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/db_${TARGET_RPS}rps.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

      <!-- ===== Redis write-behind 방식 Thread Group ===== -->
      <ThreadGroup guiclass="ThreadGroupGui" testclass="ThreadGroup" testname="Redis write-behind 방식" enabled="true">
        <stringProp name="ThreadGroup.on_sample_error">continue</stringProp>
        <elementProp name="ThreadGroup.main_controller" elementType="LoopController">
          <boolProp name="LoopController.continue_forever">false</boolProp>
          <intProp name="LoopController.loops">-1</intProp>
        </elementProp>
        <stringProp name="ThreadGroup.num_threads">200</stringProp>
        <stringProp name="ThreadGroup.ramp_time">5</stringProp>
        <boolProp name="ThreadGroup.scheduler">true</boolProp>
        <stringProp name="ThreadGroup.duration">${DURATION}</stringProp>
        <stringProp name="ThreadGroup.delay">0</stringProp>
      </ThreadGroup>
      <hashTree>
        <ConstantThroughputTimer guiclass="TestBeanGUI" testclass="ConstantThroughputTimer" testname="Redis RPS 제어" enabled="true">
          <intProp name="calcMode">1</intProp>
          <doubleProp>
            <name>throughput</name>
            <value>6000.0</value>
          </doubleProp>
          <stringProp name="throughput">${THROUGHPUT_PER_MIN}</stringProp>
        </ConstantThroughputTimer>
        <hashTree/>

        <HTTPSamplerProxy guiclass="HttpTestSampleGui" testclass="HTTPSamplerProxy" testname="Redis 메시지 전송" enabled="true">
          <stringProp name="HTTPSampler.domain">${HOST}</stringProp>
          <stringProp name="HTTPSampler.port">${PORT}</stringProp>
          <stringProp name="HTTPSampler.protocol">${PROTOCOL}</stringProp>
          <stringProp name="HTTPSampler.path">/test/bench/chat/redis?roomId=${ROOM_ID}&amp;senderNo=${SENDER_NO}&amp;receiverNo=${RECEIVER_NO}</stringProp>
          <stringProp name="HTTPSampler.method">POST</stringProp>
          <boolProp name="HTTPSampler.follow_redirects">true</boolProp>
          <boolProp name="HTTPSampler.use_keepalive">true</boolProp>
        </HTTPSamplerProxy>
        <hashTree/>

        <ResultCollector guiclass="SimpleDataWriter" testclass="ResultCollector" testname="Redis 결과 저장" enabled="true">
          <boolProp name="ResultCollector.error_logging">false</boolProp>
          <stringProp name="filename">results/redis_${TARGET_RPS}rps.csv</stringProp>
        </ResultCollector>
        <hashTree/>
      </hashTree>

    </hashTree>
  </hashTree>
</jmeterTestPlan>